let raw_data = `
名称/物资	铁砧	弹药	扩音器	望远镜	老虎钳	橡胶鞋	橡胶鸭	消防栓	汽油	医疗箱	疏通塞	螺旋桨	头奖*2.5	伤害个数	分数	双倍
B级电影怪兽			2			2					2		1.56	1.60	10	20
人生地不熟	1											1	0.47	5.33	3	6
死神之手		2			5		2						1.25	2.00	8	16
巨石怪				1				1					0.31	8.00	2	4
破盾									5	1			-1.09	-2.29	7	14
末日蜘蛛		5		2					1				1.41	1.78	9	18
末日鸭叫							10						0.00	16.00	25	26
V机器人		2							2				0.63	4.00	4	8
16吨	4				1			2					0.94	2.67	6	12
迪斯科旋风			1		1							2	0.94	2.67	6	12
传送门								3			3	4	1.25	2.00	8	16
舞鞋				3		2			2				1.56	1.60	10	20
蟒蛇				2	3	3							1.25	2.00	8	16
死鱼之灾						3	1	3					1.09	2.29	7	14
滑稽之手							1				1		0.16	16.00	1	2
天降甘霖	3	3		2									1.09	2.29	7	14
收缩射线			2		1								0.47	5.33	3	6
远古诅咒			2	3		1							1.25	2.00	8	16
号角			4		3							4	1.72	1.45	11	22
触手							1				1	2	0.31	8.00	2	4
冰风暴		2					3					1	0.94	2.67	6	12
植物						2			2		2		0.63	4.00	4	8
磁铁	2			1				2					0.47	5.33	3	6
电击之神	3		3						3				0.00	5.33	9	12
`.split('\n');
let rows = [];
var data = [];
for(var i=2;i<raw_data.length;i++){
    if(raw_data[i]==''){continue;}
    rows[i] = raw_data[i].split('\t');
    data.push({
        name: rows[i][0],
        value: rows[i].slice(1,13).map(Number),
        score: Number(rows[i][16]),
    });
}
var dataNames = raw_data[1].split('\t').slice(1);