var row_data = 
`
有	14	13	13	10	8	8	8	6	4	4	4	4
巨石怪				1				1					0.31	8.00	2	4	8	1.10074	4.40
B级电影怪兽			2			2					2		1.56	1.60	10	20	16	1	20.00
人生不地熟	1											1	0.47	5.33	3	6	16	1	6.00
破盾									5	1			-1.09	-2.29	7	14	8	1.10074	15.41
迪斯科旋风			1		1							2	0.94	2.67	6	12	16	1	12.00
末日蜘蛛		5		2					1				1.41	1.78	9	18	8	1.10074	19.81
天降甘霖	3	3		2									1.09	2.29	7	14	4	1.211628548	16.96
16吨	4				1			2					0.94	2.67	6	12	4	1.211628548	14.54
传送门								3			3	4	1.25	2.00	8	16	4	1.211628548	19.39
收缩射线			2		1								0.47	5.33	3	6	8	1.10074	6.60
死神之手		2			5		2						1.25	2.00	8	16	4	1.211628548	19.39
滑稽之手							1				1		0.16	16.00	1	2	4	1.211628548	2.42
蟒蛇				2	3	3							1.25	2.00	8	16	8	1.10074	17.61
末日鸭叫							10						0.00	16.00	25	26	16	1	26.00
死鱼之灾						3	1	3					1.09	2.29	7	14	8	1.10074	15.41
远古诅咒			2	3		1							1.25	2.00	8	16	16	1	16.00
V机器人		2							2				0.63	4.00	4	8	8	1.10074	8.81
号角			4		3							4	1.72	1.45	11	22	8	1.10074	24.22
触手							1				1	2	0.31	8.00	2	4	4	1.211628548	4.85
舞鞋				3		2			2				1.56	1.60	10	20	16	1	20.00
冰风暴		2					3					1	0.94	2.67	6	12	8	1.10074	13.21
植物						2			2		2		0.63	4.00	4	8	4	1.211628548	9.69
磁铁	2			1				2					0.47	5.33	3	6	3	1.260869766	7.57
电击之神	3		3						3				0.00	5.33	9	12	16	1	12.00
`.split('\n');
var raws = [];
var data = [];
for(var i=2;i<row_data.length;i++){
    if(row_data[i]==''){continue;}
    raws[i] = row_data[i].split('\t');
    data.push({
        name: raws[i][0],
        value: raws[i].slice(1,13).map(Number),
        score: Number(raws[i][16]),
    });
}
var own = JSON.parse(localStorage.getItem("own"));
if(own == null)own = row_data[1].split('\t').slice(1,13).map(Number);

var dataNames = 
`铁砧	弹药	扩音器	望远镜	老虎钳	橡胶鞋	橡胶鸭	消防栓	汽油	医疗箱	疏通塞	螺旋桨`.split('\t');